In [36]:
import pandas as pd
names = ['Bob','Jessica','Mary','John','Mel']
grades = [76,95,77,78,99]

In [37]:
gradeList = zip(names,grades)

In [38]:
df = pd.DataFrame(data=list(gradeList),
    columns=['Names','Grades'])
df

     Names  Grades
0      Bob      76
1  Jessica      95
2     Mary      77
3     John      78
4      Mel      99

In [41]:
print(df['Grades'].count()) # number of values
print(df['Grades'].mean()) # arithmetic average
print(df['Grades'].std()) # standard deviation
print(df['Grades'].min()) # minimum
print(df['Grades'].max()) # maximum
print(df['Grades'].var()) # variance
print(df['Grades'].median()) # mode
print(df['Grades'].quantile(.25)) # first quartile
print(df['Grades'].quantile(.5)) # second quartile
print(df['Grades'].quantile(.75)) # third quartile

5
85.0
11.067971810589327
76
99
122.5
78.0
77.0
78.0
95.0

In [42]:
df['Grades'].mode()

0    76
1    77
2    78
3    95
4    99
dtype: int64

In [30]:
names = ['Bob','Jessica','Mary','John','Mel']
grades = [76,95,77,78,99]
bsdegrees = [1,1,0,0,1]
msdegrees = [2,1,0,0,0]
phddegrees = [0,1,0,0,0]

In [32]:
gradeList = zip(names,grades,bs,ms,phd)
df = pd.DataFrame(data=list(gradeList),columns=['Name','Grade','BS','MS','PhD'])
df

      Name  Grade  BS  MS  PhD
0      Bob     76   1   2    0
1  Jessica     95   1   1    1
2     Mary     77   0   0    0
3     John     78   0   0    0
4      Mel     99   1   0    0